<?xml version="1.0" ?>
<net name="nanodet" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 320, 320"/>
			<output>
				<port id="0" names="data" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_976423588" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/scale/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_976623486" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="1, 3, 1, 1" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/mean/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="onnx::Conv_952" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="24, 3, 3, 3" size="2592"/>
			<output>
				<port id="0" names="onnx::Conv_952" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/backbone/conv1/conv1.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone/conv1/conv1.0/Conv/Dims5410" type="Const" version="opset1">
			<data element_type="f32" offset="2616" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/backbone/conv1/conv1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/conv1/conv1.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/backbone/conv1/conv1.2/LeakyRelu/weights1487822904" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/conv1/conv1.2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/conv1/conv1.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/backbone/maxpool/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="3, 3" pads_begin="1, 1" pads_end="1, 1" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="/backbone/maxpool/MaxPool_output_0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_955" type="Const" version="opset1">
			<data element_type="f32" offset="2716" shape="24, 1, 1, 3, 3" size="864"/>
			<output>
				<port id="0" names="onnx::Conv_955" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/stage2/stage2.0/branch1/branch1.0/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/backbone/stage2/stage2.0/branch1/branch1.0/Conv/Dims5188" type="Const" version="opset1">
			<data element_type="f32" offset="3580" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/stage2/stage2.0/branch1/branch1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch1/branch1.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx::Conv_958" type="Const" version="opset1">
			<data element_type="f32" offset="3676" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="onnx::Conv_958" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/backbone/stage2/stage2.0/branch1/branch1.2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/stage2/stage2.0/branch1/branch1.2/Conv/Dims5458" type="Const" version="opset1">
			<data element_type="f32" offset="9244" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone/stage2/stage2.0/branch1/branch1.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch1/branch1.2/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/stage2/stage2.0/branch1/branch1.4/LeakyRelu/weights1484222991" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/stage2/stage2.0/branch1/branch1.4/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch1/branch1.4/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_961" type="Const" version="opset1">
			<data element_type="f32" offset="9476" shape="58, 24, 1, 1" size="5568"/>
			<output>
				<port id="0" names="onnx::Conv_961" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/stage2/stage2.0/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone/stage2/stage2.0/branch2/branch2.0/Conv/Dims5416" type="Const" version="opset1">
			<data element_type="f32" offset="15044" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/backbone/stage2/stage2.0/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch2/branch2.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/stage2/stage2.0/branch2/branch2.2/LeakyRelu/weights1485423570" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/stage2/stage2.0/branch2/branch2.2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch2/branch2.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_964" type="Const" version="opset1">
			<data element_type="f32" offset="15276" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="onnx::Conv_964" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/backbone/stage2/stage2.0/branch2/branch2.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/stage2/stage2.0/branch2/branch2.3/Conv/Dims5176" type="Const" version="opset1">
			<data element_type="f32" offset="17364" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/stage2/stage2.0/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch2/branch2.3/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="onnx::Conv_967" type="Const" version="opset1">
			<data element_type="f32" offset="17596" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_967" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/stage2/stage2.0/branch2/branch2.5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/stage2/stage2.0/branch2/branch2.5/Conv/Dims5452" type="Const" version="opset1">
			<data element_type="f32" offset="31052" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/stage2/stage2.0/branch2/branch2.5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch2/branch2.5/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/stage2/stage2.0/branch2/branch2.7/LeakyRelu/weights1483823597" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/stage2/stage2.0/branch2/branch2.7/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/branch2/branch2.7/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/stage2/stage2.0/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/Concat_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/stage2/stage2.0/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" offset="31284" shape="5" size="40"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_output_0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/stage2/stage2.0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/Reshape_output_0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="403" type="Const" version="opset1">
			<data element_type="i64" offset="31324" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone/stage2/stage2.0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/Transpose_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/stage2/stage2.0/Constant_1_output_023255" type="Const" version="opset1">
			<data element_type="i64" offset="31364" shape="4" size="32"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_1_output_0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/stage2/stage2.0/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.0/Reshape_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="735622868" type="Const" version="opset1">
			<data element_type="i64" offset="31396" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="735823183" type="Const" version="opset1">
			<data element_type="i64" offset="31404" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/stage2/stage2.1/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="/backbone/stage2/stage2.1/Slice_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" names="/backbone/stage2/stage2.1/Slice_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::Conv_970" type="Const" version="opset1">
			<data element_type="f32" offset="31420" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_970" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/stage2/stage2.1/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/stage2/stage2.1/branch2/branch2.0/Conv/Dims5272" type="Const" version="opset1">
			<data element_type="f32" offset="44876" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/stage2/stage2.1/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/branch2/branch2.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/backbone/stage2/stage2.1/branch2/branch2.2/LeakyRelu/weights1476623462" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/stage2/stage2.1/branch2/branch2.2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/branch2/branch2.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx::Conv_973" type="Const" version="opset1">
			<data element_type="f32" offset="45108" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="onnx::Conv_973" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/stage2/stage2.1/branch2/branch2.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/stage2/stage2.1/branch2/branch2.3/Conv/Dims5278" type="Const" version="opset1">
			<data element_type="f32" offset="47196" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/backbone/stage2/stage2.1/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/branch2/branch2.3/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_976" type="Const" version="opset1">
			<data element_type="f32" offset="47428" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_976" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/stage2/stage2.1/branch2/branch2.5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/backbone/stage2/stage2.1/branch2/branch2.5/Conv/Dims5428" type="Const" version="opset1">
			<data element_type="f32" offset="60884" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/stage2/stage2.1/branch2/branch2.5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/branch2/branch2.5/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/stage2/stage2.1/branch2/branch2.7/LeakyRelu/weights1481422865" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/stage2/stage2.1/branch2/branch2.7/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/branch2/branch2.7/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/stage2/stage2.1/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/Concat_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/backbone/stage2/stage2.0/Constant_output_023306" type="Const" version="opset1">
			<data element_type="i64" offset="31284" shape="5" size="40"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_output_0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage2/stage2.1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/Reshape_output_0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="402" type="Const" version="opset1">
			<data element_type="i64" offset="31324" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/stage2/stage2.1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/Transpose_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/stage2/stage2.0/Constant_1_output_023333" type="Const" version="opset1">
			<data element_type="i64" offset="31364" shape="4" size="32"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_1_output_0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/stage2/stage2.1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.1/Reshape_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="736123612" type="Const" version="opset1">
			<data element_type="i64" offset="31396" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="736323372" type="Const" version="opset1">
			<data element_type="i64" offset="31404" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/stage2/stage2.2/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="/backbone/stage2/stage2.2/Slice_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" names="/backbone/stage2/stage2.2/Slice_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Conv_979" type="Const" version="opset1">
			<data element_type="f32" offset="61116" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_979" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/stage2/stage2.2/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/stage2/stage2.2/branch2/branch2.0/Conv/Dims5110" type="Const" version="opset1">
			<data element_type="f32" offset="74572" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/stage2/stage2.2/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/branch2/branch2.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/stage2/stage2.2/branch2/branch2.2/LeakyRelu/weights1491823006" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/stage2/stage2.2/branch2/branch2.2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/branch2/branch2.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="onnx::Conv_982" type="Const" version="opset1">
			<data element_type="f32" offset="74804" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="onnx::Conv_982" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/stage2/stage2.2/branch2/branch2.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage2/stage2.2/branch2/branch2.3/Conv/Dims5350" type="Const" version="opset1">
			<data element_type="f32" offset="76892" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/stage2/stage2.2/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/branch2/branch2.3/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_985" type="Const" version="opset1">
			<data element_type="f32" offset="77124" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_985" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/stage2/stage2.2/branch2/branch2.5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/stage2/stage2.2/branch2/branch2.5/Conv/Dims5158" type="Const" version="opset1">
			<data element_type="f32" offset="90580" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage2/stage2.2/branch2/branch2.5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/branch2/branch2.5/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/stage2/stage2.2/branch2/branch2.7/LeakyRelu/weights1476223069" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/stage2/stage2.2/branch2/branch2.7/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/branch2/branch2.7/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/stage2/stage2.2/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/Concat_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/stage2/stage2.0/Constant_output_023207" type="Const" version="opset1">
			<data element_type="i64" offset="31284" shape="5" size="40"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_output_0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/stage2/stage2.2/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/Reshape_output_0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="405" type="Const" version="opset1">
			<data element_type="i64" offset="31324" shape="5" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/backbone/stage2/stage2.2/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/Transpose_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/stage2/stage2.0/Constant_1_output_023609" type="Const" version="opset1">
			<data element_type="i64" offset="31364" shape="4" size="32"/>
			<output>
				<port id="0" names="/backbone/stage2/stage2.0/Constant_1_output_0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/stage2/stage2.2/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.2/Reshape_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="736623555" type="Const" version="opset1">
			<data element_type="i64" offset="31396" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="98" name="736823438" type="Const" version="opset1">
			<data element_type="i64" offset="31404" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/stage2/stage2.3/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="/backbone/stage2/stage2.3/Slice_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" names="/backbone/stage2/stage2.3/Slice_1_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="onnx::Conv_988" type="Const" version="opset1">
			<data element_type="f32" offset="90812" shape="58, 58, 1, 1" size="13456"/>
			<output>
				<port id="0" names="onnx::Conv_988" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/backbone/stage2/stage2.3/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/stage2/stage2.3/branch2/branch2.0/Conv/Dims5152" type="Const" version="opset1">
			<data element_type="f32" offset="104268" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/stage2/stage2.3/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.3/branch2/branch2.0/Conv_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/stage2/stage2.3/branch2/branch2.2/LeakyRelu/weights1480622835" type="Const" version="opset1">
			<data element_type="f32" offset="2712" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/backbone/stage2/stage2.3/branch2/branch2.2/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="/backbone/stage2/stage2.3/branch2/branch2.2/LeakyRelu_output_0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx::Conv_991" type="Const" version="opset1">
			<data element_type="f32" offset="104500" shape="58, 1, 1, 3, 3" size="2088"/>
			<output>
				<port id="0" names="onnx::Conv_991" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone/stage2/stage2.3/branch2/branch2.3/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/backbone/stage2/stage2.3/branch2/branch2.3/Conv/Dims5290" type="Const" version="opset1">
			<data element_type="f32" offset="106588" shape="1, 58, 1, 1" size="232"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/backbone/stage2/stage2.3/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
